In [1]:
from selenium import webdriver
from selenium.webdriver.common.by import By
import pandas as pd
import time

In [2]:
driver = webdriver.Chrome()

In [4]:
driver.get("https://www.boxofficemojo.com/chart/top_lifetime_gross/?area=XWW")
time.sleep(3)

In [5]:
rows = driver.find_elements(By.XPATH, "//table//tr")[1:]

In [7]:
data = []
for row in rows:
    try:
        cols = row.find_elements(By.TAG_NAME, "td")
        if len(cols) >= 4:
            rank = cols[0].text.strip()
            title = cols[1].text.strip()
            gross = cols[2].text.strip()
            year = cols[3].text.strip()
            data.append([rank, title, gross, year])
    except Exception as e:
        print("Error parsing row:", e)

In [9]:
df = pd.DataFrame(data, columns=["Rank", "Title", "Lifetime Gross", "Year"])

In [10]:
df

    Rank                          Title  Lifetime Gross  Year
0      1                         Avatar  $2,923,710,708  2009
1      2              Avengers: Endgame  $2,799,439,100  2019
2      3       Avatar: The Way of Water  $2,320,250,281  2022
3      4                        Titanic  $2,264,812,968  1997
4      5                       Ne Zha 2  $2,150,000,000  2025
..   ...                            ...             ...   ...
195  196      The Passion of the Christ    $610,063,438  2004
196  197                     Life of Pi    $609,016,565  2012
197  198               Ready Player One    $607,874,422  2018
198  199  Transformers: The Last Knight    $605,425,157  2017
199  200    Madagascar: Escape 2 Africa    $603,900,354  2008

[200 rows x 4 columns]

In [11]:
df.to_csv("top_200_movies.csv", index=False, encoding="utf-8")